In [1]:
# Pandas - dataframes
#class pandas.DataFrame(data=None, 
#                         index=None, 
#                         columns=None, 
#                         dtype=None, 
#                         copy=False)[source]
import pandas as pd
import numpy as np

In [2]:
data_dict = {'Country':    ['Belgium', 'India', 'Brazil'],
             'Capital':    ['Brussels', 'New Delhi', 'Brasilia'],
             'Population': [122020, 7774744, 3664838]}

df = pd.DataFrame(data_dict)
df

   Country    Capital  Population
0  Belgium   Brussels      122020
1    India  New Delhi     7774744
2   Brazil   Brasilia     3664838

In [3]:
# Constructing DataFrame from a dictionary.
# Example - 1 
data_dict = {'xcol1': [1, 2], 'ycol2': [3, 4], 'col3': ['a','b']}

In [4]:
# create the dataframe
df = pd.DataFrame(data_dict)
df

   xcol1  ycol2 col3
0      1      3    a
1      2      4    b

In [5]:
# major dataype
df.dtypes

xcol1     int64
ycol2     int64
col3     object
dtype: object

In [6]:
# shape of the dataframe
df.shape

(2, 3)

In [10]:
# Example - 2 
data_dict = {'one' : pd.Series([1., 2., 3.],     index=['a', 'b', 'c']),
             'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [11]:
df = pd.DataFrame(data_dict)

In [12]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [13]:
df = pd.DataFrame(data_dict, index=['d', 'b', 'a'])
df

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [14]:
df= pd.DataFrame(data_dict, index=['d', 'b', 'a'], columns=['PYTHON', 'SPARK'])
df

  PYTHON SPARK
d    NaN   NaN
b    NaN   NaN
a    NaN   NaN

In [15]:
df= pd.DataFrame(data_dict, index=['d', 'b', 'a'], columns=['two', 'one'])
df

   two  one
d  4.0  NaN
b  2.0  2.0
a  1.0  1.0

In [16]:
df.index

Index(['d', 'b', 'a'], dtype='object')

In [17]:
df.columns

Index(['two', 'one'], dtype='object')

In [18]:
# Constructing DataFrame from numpy ndarray/Lists
# Example - 1
data = {'one' : [1., 2., 3., 4.],
        'two' : [4., 3., 2., 1.]}

In [19]:
pd.DataFrame(data)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [20]:
pd.DataFrame(data, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [21]:
# From a list of dicts
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [22]:
pd.DataFrame(data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [23]:
pd.DataFrame(data, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [24]:
pd.DataFrame(data, columns=['a', 'b'], index=['first', 'second'])

        a   b
first   1   2
second  5  10

In [25]:
# Column selection, addition, deletion
data_dict = {'one' : pd.Series([1., 2., 3.],     index=['a', 'b', 'c']),
             'two' : pd.Series([1., 2., 3., 4.], index=['d', 'b', 'c', 'a'])}
df= pd.DataFrame(data_dict)
df

   one  two
a  1.0  4.0
b  2.0  2.0
c  3.0  3.0
d  NaN  1.0

In [26]:
# Column selection, addition, deletion

df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [27]:
df

   one  two
a  1.0  4.0
b  2.0  2.0
c  3.0  3.0
d  NaN  1.0

In [28]:
df['three'] = df['one'] * df['two']

In [29]:
df

   one  two  three
a  1.0  4.0    4.0
b  2.0  2.0    4.0
c  3.0  3.0    9.0
d  NaN  1.0    NaN

In [30]:
df['flag'] = df['one'] > 2
df

   one  two  three   flag
a  1.0  4.0    4.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  1.0    NaN  False

In [31]:
del df['three']
df

   one  two   flag
a  1.0  4.0  False
b  2.0  2.0  False
c  3.0  3.0   True
d  NaN  1.0  False

In [32]:
# When inserting a scalar value, it will naturally be propagated to fill 
# the column:
df['foo'] = 'bar'
df

   one  two   flag  foo
a  1.0  4.0  False  bar
b  2.0  2.0  False  bar
c  3.0  3.0   True  bar
d  NaN  1.0  False  bar

In [33]:
# handling missing values

In [34]:
series1 = pd.Series([1,2,3,4,5], index=['a', 'b', 'c', 'd', 'e'])
series2 = pd.Series([1,2,3,4,5], index=['c', 'e', 'f', 'g', 'h'])

In [35]:
series2.dtypes

dtype('int64')

In [36]:
sum_series = series1 + series2
sum_series

a    NaN
b    NaN
c    4.0
d    NaN
e    7.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [37]:
sum_series.isnull()

a     True
b     True
c    False
d     True
e    False
f     True
g     True
h     True
dtype: bool

In [38]:
sum_series.dropna()

c    4.0
e    7.0
dtype: float64

In [39]:
sum_series

a    NaN
b    NaN
c    4.0
d    NaN
e    7.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [40]:
dropped_na = sum_series.dropna()
dropped_na

c    4.0
e    7.0
dtype: float64

In [41]:
sum_series.fillna(100)

a    100.0
b    100.0
c      4.0
d    100.0
e      7.0
f    100.0
g    100.0
h    100.0
dtype: float64

In [48]:
# reading from external file
df = pd.read_csv(r'E:\MYLEARN\2-ANALYTICS-DataScience\datasets\iris.csv', sep=',')

# df = pd.read_csv('/MYLEARN/2-ANALYTICS-DataScience/datasets/iris.csv', sep=',')

In [45]:
df.head(7)

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa
5           5.4          3.9           1.7          0.4  Iris-setosa
6           4.6          3.4           1.4          0.3  Iris-setosa

In [66]:
# Assigning New Columns 
df1=df.assign(sepal_ratio = df['sepal_width'] / df['petal_length'])

In [67]:
df['sepal_ratio1'] = df['sepal_width'] / df['sepal_length']

In [68]:
df1.head()

,sepal_length,sepal_width,petal_length,petal_width,class,sepal_ratio1,sepal_ratio
0,5.1,3.5,1.4,0.2,Iris-setosa,0.686275,2.500000
1,4.9,3.0,1.4,0.2,Iris-setosa,0.612245,2.142857
2,4.7,3.2,1.3,0.2,Iris-setosa,0.680851,2.461538
3,4.6,3.1,1.5,0.2,Iris-setosa,0.673913,2.066667
4,5.0,3.6,1.4,0.2,Iris-setosa,0.720000,2.571429

In [98]:
# Indexing / Selection

In [69]:
df.loc[140]

sepal_length               6.7
sepal_width                3.1
petal_length               5.6
petal_width                2.4
class           Iris-virginica
sepal_ratio1          0.462687
Name: 140, dtype: object

In [102]:
# Data alignment and arithmetic

In [27]:
df1 = pd.DataFrame(data=np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

In [39]:
df1

          A         B         C         D
0 -1.335286  1.107863  0.809134 -1.150537
1  1.154141  0.071517 -1.055950  0.956442
2 -1.595736  0.367472 -0.216715 -0.403777
3 -0.570134 -2.141959  0.625648  0.832861
4 -1.360187  0.053981 -0.797957  0.581436
5  1.264176 -0.389289  1.590848 -0.328245
6  2.526211  0.049261 -0.725603 -0.884483
7 -1.465417 -0.787886  1.660989 -0.335721
8 -0.469233  0.825582 -1.431205 -1.124740
9  0.013209  0.264547  0.512835 -0.830010

In [40]:
df2

          A         B         C
0 -0.143725 -0.536106 -0.457485
1 -0.618142  1.294114  1.416328
2 -0.438727 -0.949875  0.451918
3 -0.644482 -0.194543 -0.153764
4  0.201983  0.431096  0.130574
5  2.854452 -0.133305 -0.645145
6  0.612714  1.084934  1.252680

In [28]:
df1 + df2

          A         B         C   D
0 -2.655173  0.177616 -1.147619 NaN
1  0.648136 -0.444682  0.954982 NaN
2  0.366677  1.518168 -2.619897 NaN
3 -3.472445  1.835305 -0.613669 NaN
4  1.090354  0.084759  0.105910 NaN
5  1.072846  2.587444 -1.563331 NaN
6  1.644158  1.041276 -1.735449 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [43]:
df1[['A', 'B']]

          A         B
0 -1.335286  1.107863
1  1.154141  0.071517
2 -1.595736  0.367472
3 -0.570134 -2.141959
4 -1.360187  0.053981
5  1.264176 -0.389289
6  2.526211  0.049261
7 -1.465417 -0.787886
8 -0.469233  0.825582
9  0.013209  0.264547

In [50]:
# boolean operators
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [51]:
df1

       a      b
0   True  False
1  False   True
2   True   True

In [52]:
df2

       a      b
0  False   True
1   True   True
2   True  False

In [53]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [111]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [112]:
df1 ^ df2

       a      b
0   True   True
1   True  False
2  False   True

In [113]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

In [114]:
# Transposing

In [115]:
df = pd.DataFrame(np.random.randn(8, 3), columns=list('ABC'))

In [116]:
df

          A         B         C
0 -0.434600 -0.090879  0.465793
1  0.068120 -0.583987 -1.836404
2  0.741085  0.327871  0.930590
3  0.702963 -0.689086 -0.267745
4  0.463092  0.762310  0.075687
5  0.601473  0.239792  0.454828
6  1.715211  0.660913  0.916108
7  0.134098 -0.050159  0.152794

In [117]:
df.T

,0,1,2,3,4,5,6,7
A,-0.434600,0.068120,0.741085,0.702963,0.463092,0.601473,1.715211,0.134098
B,-0.090879,-0.583987,0.327871,-0.689086,0.762310,0.239792,0.660913,-0.050159
C,0.465793,-1.836404,0.930590,-0.267745,0.075687,0.454828,0.916108,0.152794